In [2]:
import pandas as pd
pd.__version__

'2.3.0'

In [12]:
ser = pd.Series([1,2,3], index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [14]:
ser = ser.drop(labels=['a'])
ser

b    2
c    3
dtype: int64

In [8]:
data = [[1,2,3],[3,4,5],[6,7,8]]
dataF = pd.DataFrame(data, index=["a","b","c"], columns=["X","Y","Z"])
dataF

   X  Y  Z
a  1  2  3
b  3  4  5
c  6  7  8

In [60]:
data = pd.read_csv("Titanic-Dataset.csv", skiprows=[1,2,3], nrows=10)
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
1,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
2,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
3,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
4,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
5,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
6,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
7,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
8,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
9,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S

In [35]:
data[["Survived", "Sex"]].value_counts()
print(data["Sex"])

<bound method Series.unique of 0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object>

In [30]:
data["PassengerId"].nunique()

10

In [59]:
#help(pd.read_csv)

In [61]:
data["Name"] = data["Name"].apply(lambda x: x.lower())
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.1000,C123,S
1,5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.0500,NaN,S
2,6,0,3,"moran, mr. james",male,NaN,0,0,330877,8.4583,NaN,Q
3,7,0,1,"mccarthy, mr. timothy j",male,54.0,0,0,17463,51.8625,E46,S
4,8,0,3,"palsson, master. gosta leonard",male,2.0,3,1,349909,21.0750,NaN,S
5,9,1,3,"johnson, mrs. oscar w (elisabeth vilhelmina berg)",female,27.0,0,2,347742,11.1333,NaN,S
6,10,1,2,"nasser, mrs. nicholas (adele achem)",female,14.0,1,0,237736,30.0708,NaN,C
7,11,1,3,"sandstrom, miss. marguerite rut",female,4.0,1,1,PP 9549,16.7000,G6,S
8,12,1,1,"bonnell, miss. elizabeth",female,58.0,0,0,113783,26.5500,C103,S
9,13,0,3,"saundercock, mr. william henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S

In [63]:
data.iloc[0]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           futrelle, mrs. jacques heath (lily may peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 0, dtype: object

In [69]:
print(data[data.Age > 30][["Pclass","Sex","Survived"]])

<bound method DataFrame.value_counts of    Pclass     Sex  Survived
0       1  female         1
1       3    male         0
3       1    male         0
8       1  female         1>

In [72]:
len(data[data.Age > 30])

4

In [93]:
tit = pd.read_csv("Titanic-Dataset.csv")
copy_tit = tit.copy()
#copy_tit = copy_tit.isna()
age_mean = copy_tit["Age"].mean()
copy_tit.loc[copy_tit["Age"].isna(), "Age"] = age_mean
copy_tit.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                   29.699118
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [ ]:
copy_tit = copy_tit.fillna(copy_tit["Age"].mean)

In [115]:
s = copy_tit["Cabin"].isna().sum()
s

np.int64(687)